tests/artillery/loadtest-pg.yml
config:
  target: 'http://localhost:3004'
  processor: './artillery-scripts.js'
  pool: 6
  phases:
    - duration: 20
      arrivalRate: 20
      rampTo: 40
  # defaults:
  #   headers:
  #     x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: 'Users landing on a page'
    flow:
      - loop:
        # Call generateRandomIndex to get random :id endpoint
        - function: 'generateRandomIndex'
        - get:
            url: "/api/restaurants/{{ id }}/recommendations"
        count: 40